//
// Created by Tr on 31.08.2021.
//

#ifndef OOP_CARD_H
#define OOP_CARD_H

 /*
  * 4. Создать класс Card, описывающий карту в игре БлэкДжек. У этого класса должно быть три поля:
  * масть, значение карты и положение карты (вверх лицом или рубашкой).
  * Сделать поля масть и значение карты типом перечисления (enum). Положение карты - тип bool.
  * Также в этом классе должно быть два метода:
  *         • метод Flip(), который переворачивает карту, т.е. если она была рубашкой вверх,
  *           то он ее поворачивает лицом вверх, и наоборот.
  *         • метод GetValue(), который возвращает значение карты, пока можно считать, что туз = 1.
*/


class Card {

};


#endif //OOP_CARD_H
